In [48]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame
df = DataFrame({'key1':['a','a','b','b','a'],
               'key2':['one','two','one','two','one'],
               'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.002192  1.184278    a  one
1  1.318708  0.339507    a  two
2  0.653069  0.391889    b  one
3  0.743155 -0.103014    b  two
4  0.291667  0.045241    a  one

In [2]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [3]:
grouped.mean()

key1
a    0.206193
b    0.025417
Name: data1, dtype: float64

In [4]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one     0.282689
      two     0.053201
b     one     0.529066
      two    -0.478233
Name: data1, dtype: float64

In [5]:
means.unstack()

key2       one       two
key1
a     0.282689  0.053201
b     0.529066 -0.478233

In [6]:
states = np.array(['ohio','california','california','ohio','ohio'])
years = np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

california  2005    0.053201
            2006    0.529066
ohio        2005   -0.170674
            2006    0.428494
Name: data1, dtype: float64

In [7]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.206193 -0.247458
b     0.025417 -0.597506

In [8]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.282689 -0.414841
     two   0.053201  0.087308
b    one   0.529066 -1.670915
     two  -0.478233  0.475902

In [10]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.136884 -0.236161    a  one
1  0.053201  0.087308    a  two
4  0.428494 -0.593522    a  one
b
      data1     data2 key1 key2
2  0.529066 -1.670915    b  one
3 -0.478233  0.475902    b  two

In [11]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print(k1,k2)
    print(group)

a one
      data1     data2 key1 key2
0  0.136884 -0.236161    a  one
4  0.428494 -0.593522    a  one
a two
      data1     data2 key1 key2
1  0.053201  0.087308    a  two
b one
      data1     data2 key1 key2
2  0.529066 -1.670915    b  one
b two
      data1     data2 key1 key2
3 -0.478233  0.475902    b  two

In [12]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2  0.529066 -1.670915    b  one
3 -0.478233  0.475902    b  two

In [13]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [14]:
grouped = df.groupby(df.dtypes,axis=1)

In [15]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  0.136884 -0.236161
 1  0.053201  0.087308
 2  0.529066 -1.670915
 3 -0.478233  0.475902
 4  0.428494 -0.593522, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [16]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [17]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [18]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.414841
     two   0.087308
b    one  -1.670915
     two   0.475902

In [19]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [20]:
s_grouped

In [21]:
s_grouped.mean()

key1  key2
a     one    -0.414841
      two     0.087308
b     one    -1.670915
      two     0.475902
Name: data2, dtype: float64

In [24]:
people = DataFrame(np.random.randn(5,5),
                  columns=['a','b','c','d','e'],
                  index=['joe','steve','wes','jim','travis'])

In [25]:
people.ix[2:3,['b','c']]=np.nan

D:\anaconde\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [26]:
people

               a         b         c         d         e
joe    -0.708459  0.219940  0.263308 -0.099607  0.202575
steve  -0.830558 -0.138807  0.733401  1.094478 -0.266039
wes     0.150558       NaN       NaN -0.942408  1.504088
jim    -0.366341  0.115439 -0.134333  0.622813  2.373619
travis -0.939652 -0.257906 -0.110181  1.646322  1.329654

In [27]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [30]:
by_column = people.groupby(mapping,axis=1)
by_column

In [29]:
by_column.sum()

            blue       red
joe     0.163701 -0.285944
steve   1.827879 -1.235403
wes    -0.942408  1.654646
jim     0.488480  2.122718
travis  1.536141  0.132096

In [31]:
map_series = Series(mapping)

In [32]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [33]:
people.groupby(map_series,axis=1).count()

        blue  red
joe        2    3
steve      2    3
wes        1    2
jim        2    3
travis     2    3

In [34]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.924242  0.335379  0.128975 -0.419202  4.080282
5 -0.830558 -0.138807  0.733401  1.094478 -0.266039
6 -0.939652 -0.257906 -0.110181  1.646322  1.329654

In [35]:
key_list = ['one','one','one','two','two']

In [36]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.708459  0.219940  0.263308 -0.942408  0.202575
  two -0.366341  0.115439 -0.134333  0.622813  2.373619
5 one -0.830558 -0.138807  0.733401  1.094478 -0.266039
6 two -0.939652 -0.257906 -0.110181  1.646322  1.329654

In [37]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],
                                    names=['cty','tenor'])

In [38]:
hier_df = DataFrame(np.random.randn(4,5),columns=columns)

In [39]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.769106 -0.412398 -1.357742 -0.932516 -0.476888
1      1.924569 -1.373670 -0.374208 -0.366517 -1.333844
2      0.525152 -0.688034  0.202914  1.138478  1.209206
3     -0.762648 -0.826842  0.575824  1.152151  0.116739

In [40]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [49]:
df

      data1     data2 key1 key2
0  0.002192  1.184278    a  one
1  1.318708  0.339507    a  two
2  0.653069  0.391889    b  one
3  0.743155 -0.103014    b  two
4  0.291667  0.045241    a  one

In [14]:
grouped = df.groupby('key1')

In [15]:
grouped['data1'].quantile(0.9)

key1
a    0.51302
b    0.42643
Name: data1, dtype: float64

In [50]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [51]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.781755  3.291877
b     0.446423  0.543097

In [46]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.206193  0.197013  0.053201  0.095043  0.136884  0.282689
b      2.0  0.025417  0.712268 -0.478233 -0.226408  0.025417  0.277241

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.428494   3.0 -0.247458  0.340555 -0.593522 -0.414841 -0.236161
b     0.529066   2.0 -0.597506  1.518029 -1.670915 -1.134211 -0.597506


           75%       max
key1
a    -0.074427  0.087308
b    -0.060802  0.475902

In [52]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame
tips = pd.read_csv(r'D:\pythondata\ch08\tips.csv')

In [53]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [54]:
tips[:6]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240

In [55]:
grouped = tips.groupby(['sex','smoker'])

In [56]:
grouped_pct = grouped['tip_pct']

In [57]:
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [58]:
grouped_pct.agg(['mean','std',peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [59]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [60]:
functions = ['count','mean','max']

In [62]:
result = grouped['tip_pct','total_bill'].agg(functions)

In [63]:
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [64]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [65]:
ftuples = [('Durchschnitt','mean'),('Abweichung',np.var)]

In [66]:
grouped['tip_pct','total_bill'].agg(ftuples)

                   tip_pct              total_bill
              Durchschnitt Abweichung Durchschnitt Abweichung
sex    smoker
Female No         0.156921   0.001327    18.105185  53.092422
       Yes        0.182150   0.005126    17.977879  84.451517
Male   No         0.160669   0.001751    19.791237  76.152961
       Yes        0.152771   0.008206    22.284500  98.244673

In [67]:
grouped.agg({'tip':np.max,'size':'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [68]:
grouped.agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

In [69]:
tips.groupby(['sex','smoker'],as_index=False).mean()

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

In [70]:
df

      data1     data2 key1 key2
0  0.002192  1.184278    a  one
1  1.318708  0.339507    a  two
2  0.653069  0.391889    b  one
3  0.743155 -0.103014    b  two
4  0.291667  0.045241    a  one

In [71]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')

In [72]:
k1_means

      mean_data1  mean_data2
key1
a       0.537523    0.523009
b       0.698112    0.144437

In [73]:
pd.merge(df,k1_means,left_on='key1',right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0  0.002192  1.184278    a  one    0.537523    0.523009
1  1.318708  0.339507    a  two    0.537523    0.523009
4  0.291667  0.045241    a  one    0.537523    0.523009
2  0.653069  0.391889    b  one    0.698112    0.144437
3  0.743155 -0.103014    b  two    0.698112    0.144437

In [74]:
key = ['one','two','one','two','one']